# Pandas

Pandas - это библиотека для удобной работы с данными, в основном - с таблицами. В библиотеке есть много методов, которые нужны для чтения данных в разном формате, взаимодействия с базами данных и для разных манипуляций, которые часто нужны в процессе работы.

Чтобы сократить число символов, часто при импорте ```pandas``` заменяют просто на ```pd```

In [1]:
import pandas as pd

### Создание таблиц

Для начала, посмотрим, как выглядят таблицы (объекты) в pandas на примере небольших таблиц, созданных вручную.

Есть специальный объект типа датафрейм и мы туад передаем информацию о данных, которые у нас есть. Это может быть разный вид, например:

1. Словарь, где ключ - название будущего столбца, а значение - это список значений.
2. Список словарей, где одна запись - это отдельная строка таблицы, где ключи - это параметры (название столбца).
3. Список списков (или кортежей), где каждый элемент - это одна строка таблицы. В этом случае названия стобцов задаются отдельно.

In [2]:
data = {
    "name": ["Mary", "Jane", "Ivan", "Mark"],
    "age": [25, 14, 34, 78]
}

df = pd.DataFrame(data)
df

   name  age
0  Mary   25
1  Jane   14
2  Ivan   34
3  Mark   78

In [3]:
data = [
    {"name": "Mary", "age": 25}, 
    {"name": "Jane", "age": 14}, 
    {"name": "Ivan", "age": 34}, 
    {"name": "Mark", "age": 78}
]

df = pd.DataFrame(data)
df

   name  age
0  Mary   25
1  Jane   14
2  Ivan   34
3  Mark   78

In [4]:
data = [["Mary", 25], ["Jane", 14], ["Ivan", 34], ["Mark", 78]]

df = pd.DataFrame(data, columns=["name", "age"])
df

   name  age
0  Mary   25
1  Jane   14
2  Ivan   34
3  Mark   78

### Чтение данных

Рассмотрим несколько основных способов прочитать данные.

1. CSV файл (табличный формат с различными разделителями, в том числе запятая, таб, точка с запятой и др.)
2. Excel-файл
3. База данных (посмотрим, когда будем работать с базами)
4. Онлайн-таблицы (на страницах сайта)

In [5]:
df = pd.read_csv("data/example.csv", sep="\t")  # разделитель табуляция
df

   name  age
0  Mary   25
1  Ivan   34

In [6]:
df = pd.read_excel("data/example.xlsx", sheet_name="example")
df

   name  age
0  Mary   25
1  Ivan   34

In [7]:
df = pd.read_html("https://en.wikipedia.org/wiki/List_of_countries_and_dependencies_by_population")[0]
df

,Rank,Country(or dependent territory),Population,% of world,Date,Source(official or UN)
0,1,China[b],1404600200,NaN,26 Sep 2020,National population clock[3]
1,2,India[c],1367662851,NaN,26 Sep 2020,National population clock[4]
2,3,United States[d],330369487,NaN,26 Sep 2020,National population clock[5]
3,4,Indonesia,269603400,NaN,1 Jul 2020,National annual projection[6]
4,5,Pakistan[e],220892331,NaN,1 Jul 2020,UN Projection[2]
...,...,...,...,...,...,...
237,–,Tokelau (NZ),1400,NaN,1 Jul 2018,National annual estimate[93]
238,195,Vatican City[ab],825,NaN,1 Feb 2019,Monthly national estimate[207]
239,–,Cocos (Keeling) Islands (Australia),555,NaN,30 Jun 2019,National annual estimate[206]
240,–,Pitcairn Islands (UK),50,NaN,1 Jan 2020,National annual estimate[208]
241,NaN,World,7815719000,100%,26 Sep 2020,UN Projection[209]

In [8]:
df = pd.read_csv("https://raw.githubusercontent.com/cldf-datasets/wals/master/raw/country.csv")

In [9]:
df.head()

,pk,jsondata,id,name,description,markup_description,continent
0,1,NaN,AF,Afghanistan,NaN,NaN,Asia
1,2,NaN,AL,Albania,NaN,NaN,Europe
2,3,NaN,DZ,Algeria,NaN,NaN,Africa
3,4,NaN,AS,American Samoa,NaN,NaN,Australia & Oceania
4,5,NaN,AO,Angola,NaN,NaN,Africa

### Сохраняем данные

In [10]:
df.to_csv("wals_country.csv", index=None)

### Манипуляции с данными

**Фильтрация данных**

Можно удалять отдельные строки или столбцы

In [11]:
df = df.drop(["jsondata", "description"], axis=1) # убираем столбцы

# проверяем
df.head(2)

   pk  id         name  markup_description continent
0   1  AF  Afghanistan                 NaN      Asia
1   2  AL      Albania                 NaN    Europe

Можно удалять те, где есть пропуски

In [12]:
df.dropna()

Empty DataFrame
Columns: [pk, id, name, markup_description, continent]
Index: []

Здесь во всех строчка в столбца markup_description ничего нет и все удаляется

In [13]:
df.shape, df.dropna().shape

((192, 5), (0, 5))

Удалим столбцы, где все значения пустые

In [14]:
df.dropna(how="all", axis=1).head()

   pk  id            name            continent
0   1  AF     Afghanistan                 Asia
1   2  AL         Albania               Europe
2   3  DZ         Algeria               Africa
3   4  AS  American Samoa  Australia & Oceania
4   5  AO          Angola               Africa

Можно выбрать нужные столбцы

In [15]:
df = df[["pk", "id", "name", "continent"]]

In [16]:
df.head()

   pk  id            name            continent
0   1  AF     Afghanistan                 Asia
1   2  AL         Albania               Europe
2   3  DZ         Algeria               Africa
3   4  AS  American Samoa  Australia & Oceania
4   5  AO          Angola               Africa

Фильтруем, где pk < 4

In [17]:
df[df["pk"] < 4]

   pk  id         name continent
0   1  AF  Afghanistan      Asia
1   2  AL      Albania    Europe
2   3  DZ      Algeria    Africa

Посмотрим, какие вообще есть континенты

In [18]:
df["continent"].value_counts()

Africa                 54
Asia                   46
Europe                 38
Australia & Oceania    22
North America          17
South America          13
Eurasia                 2
Name: continent, dtype: int64

In [19]:
df[df["continent"] == "North America"]

      pk  id                  name      continent
14    15  BZ                Belize  North America
26    27  CA                Canada  North America
34    35  CR            Costa Rica  North America
42    43  DM              Dominica  North America
46    47  SV           El Salvador  North America
63    64  GD               Grenada  North America
66    67  GT             Guatemala  North America
70    71  HT                 Haiti  North America
71    72  HN              Honduras  North America
81    82  JM               Jamaica  North America
105  106  MQ            Martinique  North America
109  110  MX                Mexico  North America
120  121  AN  Netherlands Antilles  North America
123  124  NI             Nicaragua  North America
158  159  LC             St. Lucia  North America
173  174  TT   Trinidad and Tobago  North America
182  183  US         United States  North America

Отсортируем эти страны по алфавиту по ID

In [20]:
df[df["continent"] == "North America"].sort_values(by="id")

      pk  id                  name      continent
120  121  AN  Netherlands Antilles  North America
14    15  BZ                Belize  North America
26    27  CA                Canada  North America
34    35  CR            Costa Rica  North America
42    43  DM              Dominica  North America
63    64  GD               Grenada  North America
66    67  GT             Guatemala  North America
71    72  HN              Honduras  North America
70    71  HT                 Haiti  North America
81    82  JM               Jamaica  North America
158  159  LC             St. Lucia  North America
105  106  MQ            Martinique  North America
109  110  MX                Mexico  North America
123  124  NI             Nicaragua  North America
46    47  SV           El Salvador  North America
173  174  TT   Trinidad and Tobago  North America
182  183  US         United States  North America

Допустим, мы хотим получить список стран по континентам

1. Группируем по континенту
2. Из имен составляем списки

In [21]:
df.groupby("continent").agg({"name": list})

                                                                  name
continent
Africa               [Algeria, Angola, Benin, Botswana, Burkina Fas...
Asia                 [Afghanistan, Armenia, Azerbaijan, Bahrain, Ba...
Australia & Oceania  [American Samoa, Australia, Fiji, French Polyn...
Eurasia                                               [Russia, Turkey]
Europe               [Albania, Austria, Belarus, Belgium, Bosnia-He...
North America        [Belize, Canada, Costa Rica, Dominica, El Salv...
South America        [Argentina, Bolivia, Brazil, Chile, Colombia, ...

Посчитаем среднее по pk (**это не имеет смысла, просто пример**)

In [22]:
df.groupby("continent").agg({"pk": "mean"})

                             pk
continent
Africa                94.703704
Asia                 104.195652
Australia & Oceania  113.909091
Eurasia              159.500000
Europe                85.921053
North America         88.235294
South America         79.307692

Можно применять функции к столбцам. Например, есть функция, которая принимает один аргумент и возвращает один аргумент. Ее можно применить к столбцу и преобраховать его содержимое.

In [23]:
def change_id(text):
    if type(text) == str:
        text = text.lower() * 2
    return text

In [24]:
df["id"].apply(change_id)

0      afaf
1      alal
2      dzdz
3      asas
4      aoao
       ...
187    wfwf
188    yeye
189    zmzm
190    zwzw
191    ssss
Name: id, Length: 192, dtype: object

## Практика

Скачаем данные по кинопрокату [тут](https://opendata.mkrf.ru/opendata/7705851331-register_movies)

Считаем таблицу (можно прямо из zip), замените путь на путь к вашему файлу

In [36]:
your_zip = "/home/dkbrz/hse_python/seminars/visualization/data/data-6-structure-3.csv.zip"
df = pd.read_csv(your_zip)

Покажите верхушку датафрейма

Покажите, какие есть столбцы в датафрейме (атрибут df.columns)

Выберите столбцы ```["Название фильма", "Год производства", "Вид Фильма", "Продолжительность демонстрации, минуты", "Страна производства"]```

Сколько фильмов каждого типа в наборе данных?

Какая проблема есть в данных? Как можно ее исправить с помощью ```apply```?

In [ ]:
def fix_film_type(text):
    
    # ваш код
    
    return new_text

In [ ]:
# тестируем

text = ""

fix_film_type(text)

In [ ]:
# применяем

In [ ]:
# повторим запрос по количеству фильмов

Заменим длинные названия столбцов на более короткие на латинице

Какова средняя или медианная продолжительность фильмов по странам? И сколько фильмов?

## Более сложные манипуляции с данными

Пример того, как можно сделать таблицу по годам и по странам одновременно

In [40]:
# фильтруем и группируем

# копия датафрейма - это можно делать, если он небольшой
df2 = df.copy()

# считаем длину поля год (она в текстовом формате): если строка, то длина, иначе 0
df2["len"] = df2["prod_year"].apply(lambda x: len(x) if (type(x) == str) else 0)

# фильтруем 4-значный год и год после 2009
df2 = df2[(df2["len"] == 4) & (df2["prod_year"] > "2009")]

# группируем по году и по стране
df2 = df2.groupby(["country", "prod_year"]).agg({"film_name": "count"})

df2.head()

                       film_name
country     prod_year
 Нидерланды 2019               1
 Россия     2016               1
2014        2014               1
2018        2018               1
2019        2019               1

Создаем таблицу, где строчки - это страны, столбцы - это года, а значения - наше количество фильмов

In [41]:
df2 = df2.pivot_table(index="country", columns="prod_year", values="film_name")
df2.head()

prod_year    2010  2011  2012  2013  2014  2015  2016  2017  2018  2019  2020
country
 Нидерланды   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   1.0   NaN
 Россия       NaN   NaN   NaN   NaN   NaN   NaN   1.0   NaN   NaN   NaN   NaN
2014          NaN   NaN   NaN   NaN   1.0   NaN   NaN   NaN   NaN   NaN   NaN
2018          NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   1.0   NaN   NaN
2019          NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   1.0   NaN

Тут много мусора, поэтому отсортируем по количеству фильмов и возьмем топ

In [42]:
df2["total"] = df2.sum(axis=1)

In [43]:
df2.sort_values(by="total", ascending=False).head(25)

prod_year,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020,total
country,,,,,,,,,,,,
Россия,1952.0,1786.0,1535.0,1448.0,1515.0,1336.0,1143.0,1194.0,1231.0,1244.0,451.0,14835.0
США,585.0,501.0,494.0,398.0,307.0,243.0,203.0,170.0,231.0,174.0,44.0,3350.0
Великобритания,98.0,77.0,75.0,51.0,44.0,27.0,19.0,38.0,21.0,31.0,10.0,491.0
Франция,30.0,51.0,45.0,44.0,35.0,27.0,27.0,31.0,38.0,26.0,4.0,358.0
Германия,25.0,19.0,67.0,27.0,14.0,9.0,8.0,12.0,15.0,16.0,6.0,218.0
Италия,23.0,25.0,14.0,14.0,11.0,10.0,15.0,11.0,13.0,20.0,3.0,159.0
Украина,19.0,23.0,15.0,8.0,8.0,2.0,10.0,17.0,17.0,3.0,NaN,122.0
Канада,19.0,23.0,16.0,16.0,6.0,6.0,5.0,10.0,8.0,9.0,NaN,118.0
США - Великобритания,18.0,9.0,11.0,19.0,13.0,6.0,8.0,5.0,9.0,3.0,1.0,102.0
Испания,14.0,12.0,13.0,16.0,4.0,7.0,4.0,8.0,3.0,5.0,2.0,88.0
США - Канада,30.0,20.0,9.0,2.0,3.0,4.0,3.0,5.0,1.0,6.0,NaN,83.0
Япония,11.0,6.0,12.0,8.0,3.0,8.0,5.0,6.0,8.0,15.0,NaN,82.0
КНР,13.0,3.0,11.0,20.0,14.0,4.0,5.0,4.0,4.0,2.0,NaN,80.0
Южная Корея,7.0,18.0,7.0,2.0,10.0,3.0,6.0,4.0,4.0,9.0,4.0,74.0
Франция - Бельгия,4.0,2.0,11.0,7.0,7.0,3.0,12.0,7.0,7.0,10.0,1.0,71.0
Австралия,8.0,11.0,9.0,12.0,5.0,3.0,3.0,5.0,5.0,6.0,NaN,67.0
Великобритания - США,5.0,3.0,2.0,6.0,1.0,5.0,4.0,6.0,10.0,7.0,NaN,49.0
Индия,18.0,4.0,3.0,1.0,1.0,NaN,2.0,4.0,5.0,2.0,NaN,40.0
Норвегия,3.0,3.0,4.0,6.0,2.0,4.0,1.0,4.0,4.0,5.0,1.0,37.0
Республика Кипр,NaN,NaN,NaN,NaN,2.0,2.0,12.0,7.0,11.0,3.0,NaN,37.0
Дания,2.0,10.0,5.0,3.0,1.0,1.0,6.0,3.0,3.0,NaN,NaN,34.0
Швеция,2.0,3.0,10.0,6.0,1.0,1.0,3.0,NaN,3.0,3.0,NaN,32.0
Европейский Союз,23.0,7.0,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,31.0
США - Франция,6.0,NaN,2.0,5.0,8.0,5.0,3.0,NaN,NaN,1.0,NaN,30.0
Канада - США,10.0,NaN,2.0,3.0,NaN,NaN,1.0,1.0,7.0,3.0,NaN,27.0